[
  {
    "id": "oiCcmzs1Sksj_ZFSAAAAAA==",
    "title": "React Software Developer - PostgreSQL AWS",
    "company": "Peraton",
    "location": "",
    "salary": "Not specified",
    "posted": "2d",
    "tags": "",
    "url": "https://www.linkedin.com/jobs/view/react-software-developer-postgresql-aws-at-peraton-4272447724?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "About Peraton\n\nPeraton is a next-generation national security company that drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted, highly differentiated solutions and technologies to protect our nation and allies. Peraton operates at the critical nexus between traditional and nontraditional threats across all domains: land, sea, space, air, and cyberspace. The company serves as a valued partner to essential government agencies and supports every branch of the U.S. armed forces. Each day, our employees do the can't be done by solving the most daunting challenges facing our customers. Visit peraton.com to learn how we're keeping people around the world safe and secure.\n\nProgram Overview\n\nAbout The Role\n\nTechnology is constantly changing, and our adversaries are digitally exceeding law enforcement's ability to keep pace. Those charged with protecting the United States are not always able to access the evidence needed to prosecute crime and prevent terrorism. The Government has trusted in Peraton to provide the technical ability, tools, and resources to bring criminals to justice. In response to this challenge, Peraton is seeking skilled Full Stack Software Developers to develop a dynamic forms, web-based, application in a React, Node.JS and AWS environment.\n\nResponsibilities:\n• Design, test, and develop well designed web based software coding that is testable and efficient by using best software development practices to meet user's needs using tools like React, AWS, Postgres, and others\n• Translate the UI/UX design wireframes, ensuring software continues to function normally through software maintenance and testing; and documenting every aspects of the application, service or environment as a reference for future maintenance and upgrades.\n• Collaborate with customers and technical resources to translate requirements into Epics, Features, and User Stories for functional and non-functional requirements.\n• Support Agile teams in Backlog planning, work item refinement, and story point analysis.\n• Ensure User Stories have well-defined acceptance criteria.\n• Demonstrate work completed in a sprint to the customer.\n• Design software and solutions using industry standard design patterns and best practices.\n• Apply coding standards that support secure coding practices.\n• Develop automated unit and integration tests for continuous integration and delivery (CI/CD) pipelines.\n\nQualifications\n\nQualifications:\n• A current Top Secret security clearance with SCI eligibility and the ability to obtain a polygraph.\n• 4 years with AS/AA; 2 years with BS/BA; 0 years with MS/MA; 6 years with no degree.\n• Experience with implementing and using GitHub for CI/CD pipelines and DevSecOps deployments.\n• Experience with microservices, virtualization, and containerized deployments.\n• Experience with in React, Java, Javascript, Spring Boot in Visual Studio IDE.\n• Experience with SQL Server and PostgreSQL database technologies.\n\nPeraton offers enhanced benefits to employees working on this critical National Security program, which include heavily subsidized employee benefits coverage for you and your dependents, 25 days of PTO accrued annually up to a generous PTO cap and eligibility to participate in an attractive bonus plan.\n\nSCA / Union / Intern Rate or Range\n\nDetails\n\nTarget Salary Range: $80,000 - $128,000. This represents the typical salary range for this position based on experience and other factors.\n\nEEO:Equal opportunity employer, including disability and protected veterans, or other characteristics protected by law."
  },
  {
    "id": "knJdF3gVDXkaVoxHAAAAAA==",
    "title": "Software Developer (Full Stack - Python, React)",
    "company": "US News & World Report ,L.P.",
    "location": "",
    "salary": "Not specified",
    "posted": "Recently",
    "tags": "",
    "url": "https://www.indeed.com/viewjob?jk=67bc3b2bb970485b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "U.S. News & World Report is a multifaceted digital media company dedicated to helping citizens, consumers, business leaders and policy officials make important decisions in their lives. We publish independent reporting, rankings, data journalism and advice that has earned the trust of our readers and users for over 90 years. Our platforms on usnews.com include Education, Health, Money, Travel, Cars, News and 360 Reviews.\n\nWe reach millions of people monthly during moments when they are most in need of expert advice and motivated to act on that advice directly on our platforms. Our signature franchises include our “Best” series of consumer guides on colleges, graduate schools, hospitals, diets, cars, financial services and more. These guides provide an easy-to-digest list for consumers to better understand and compare when making their decisions. We continue to publish annual guides of the authoritative Best Colleges and Best Hospitals rankings on our website and in print. And our U.S. News Live flagship conferences highlight important national conversations including Healthcare of Tomorrow and Healthiest Communities.\n\nWe believe in having a broad range of talent and backgrounds at U.S. News. We strive to maintain a welcoming workplace where everyone is given an opportunity to succeed and contribute to their fullest. Learn more about our Diversity, Equity and Inclusion initiative.\n\nYour role in helping us shape the future:\n\nWe are looking for an enthusiastic full stack Software Developer with an interest in building dynamic, data-driven products.\n\nU.S. News empowers everyone to thrive. The developers at U.S. News have a great deal of independence and a minimum of overhead. By leveraging React.js, Python, AWS cloud, Google BigQuery, data science and other latest technologies, you’ll be driving a major transformation within U.S. News.\n\nThe successful candidate will become an influential member of a passionate, friendly, and growing team that creates web applications which reach millions of visitors monthly. Developers typically see applications through from beginning to end, working directly with project owners to create, implement, upgrade, optimize, and test features and projects.\n\nWe offer a casual, flexible, hybrid-remote work environment. Our office is located in the West End neighborhood of Washington, DC.\n\nAre you up to the challenge?\n\nThis position requires comfort working with front-end development and web standards as well as backend technologies. Our developers thrive in a collaborative environment but also excel at solving challenges independently. We use many different technologies and operate in many different environments, and we work together with designers, analysts, stakeholders, and testers to build products as efficiently and effectively as possible. We also believe in perpetual self-improvement, and expect our employees to continue to work towards developing their own skills and the skills of those around them."
  },
  {
    "id": "5oQlZkOvwnUAggHEAAAAAA==",
    "title": "Senior Full Stack React Developer (On-Site)",
    "company": "Lion Federal",
    "location": "",
    "salary": "Not specified",
    "posted": "Recently",
    "tags": "",
    "url": "https://www.indeed.com/viewjob?jk=5f515c2eee9e24eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "Senior Full Stack React Developer\n\nJob Type: On-site, full-time\n\nCity: Falls Church\n\nState/Province: Virginia\n\nLion Federal is a dynamic and rapidly expanding tech company dedicated to delivering cutting-edge AI-powered solutions tailored for enterprise-level clients, including the U.S. Federal government.\n\nAt Lion Federal, we believe our team is the heartbeat of our success. We’ve built an environment where your growth is nurtured, and your voice truly matters. Here, you’ll enjoy all the benefits of a large company, along with some rare perks that set us apart:\n• Build genuine connections with team members at all levels\n• Get quick, meaningful responses from leadership who genuinely care\n• Feel a true sense of ownership, because your insights and feedback shape the future of our company\n\nWe are seeking a highly motivated and experienced Senior Full Stack React Developer to join our dynamic team in Falls Church, VA.\n\nPosition Summary:\n\nIn this role, you will be responsible for both front-end and back-end development, working on building a scalable and efficient platform for enterprise clients. You will collaborate closely with our API and AI development teams to ensure seamless integration and optimal performance. The ideal candidate should be self-driven and capable of delivering robust, high-quality code in a fast-paced environment.\n\nKey Responsibilities:\n• Lead the design, development, and deployment of full-stack web applications using React (front-end) and Node.js, Python, or other relevant back-end technologies.\n• Build and optimize APIs and services for performance, scalability, and security.\n• Collaborate with back-end and AI/ML teams to integrate APIs, databases, and AI-driven services.\n• Ensure the platform is scalable, secure, and optimized for performance, both on the front end and back end.\n• Write clean, maintainable, and well-documented code.\n• Participate in the full software development lifecycle, including code reviews, testing, and continuous deployment.\n• Take ownership of the product lifecycle, ensuring MVPs are delivered quickly to meet business deadlines.\n• Stay up-to-date with industry trends and emerging technologies to ensure our platform stays at the forefront of innovation.\n\nRequirements\n\nRequirements:\n• 5+ years of professional experience in full-stack development with a strong focus on React for front-end development.\n• Proficiency in front-end technologies like JavaScript/TypeScript, HTML5, CSS3, and state management libraries (Redux, Context API).\n• Expertise in back-end technologies like Node.js, Python, or similar, along with experience in building RESTful APIs.\n• Strong understanding of database systems (SQL, NoSQL) and cloud infrastructure (AWS, Azure, Google Cloud).\n• Familiarity with version control tools like Git and CI/CD pipelines.\n• Experience with containerization tools (Docker) and cloud deployment (Kubernetes) is a plus.\n• Excellent communication and problem-solving skills.\n• Self-starter with a passion for innovation and delivering high-quality products.\n\nNice-to-Haves:\n• Experience with AI/ML technologies, particularly Generative AI or LLMs.\n• Exposure to cloud platforms such as AWS, Azure, or Google Cloud.\n• Knowledge of DevOps practices and cloud infrastructure management.\n\nBenefits\n\nWhy Join Us?\n• Be a key player in building innovative AI-driven solutions for enterprise clients.\n• Collaborate with a team of experienced developers and AI experts.\n• Competitive salary and benefits package.\n• Opportunity to make a significant impact and shape the future of our product.\n\nBenefits:\n• Comprehensive CareFirst BCBS Medical, Dental, and Vision insurance fully covered for you and your family\n• Supportive team environment with outstanding leadership that values employee well-being\n• Generous paid time off, plus 11 paid holidays\n• 401(k) retirement plan with employer match\n• Performance-driven bonus program\n• Budget allocated for professional development and growth"
  },
  {
    "id": "A6774wqsp04hqdd1AAAAAA==",
    "title": "Sr. React Developer Jobs",
    "company": "Arena Technical Resources",
    "location": "",
    "salary": "Not specified",
    "posted": "2d",
    "tags": "",
    "url": "https://www.clearancejobs.com/jobs/8454745/sr-react-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "Job Title: Sr React Developer\n\nJob Location: Washington, D.C. – Remote\n\nEligibility/Clearance: Secret Clearance preferred, the candidate will be\n\nrequired to obtain and maintain a Secret security clearance, depending\n\non the project requirements.\n\nJob Description:\n\nThe Senior React Developer will be responsible for creating robust and\n\nscalable web applications using React. This position will play a crucial\n\nrole in developing and optimizing the company's B2B applications and\n\nexperiences. As a Senior React Developer, you will have the opportunity\n\nto contribute to the development of cutting-edge AI platforms and shape\n\nthe user experience. Deep experience with Generative AI is strongly\n\npreferred.\n\nResponsibilities (include but are not limited to):\n\n• Collaborate with end users and stakeholders to understand requirements\n\nand translate them into high-quality, scalable web applications\n\n• Design and develop user interfaces using React, ensuring a seamless\n\nand engaging user experience\n\n• Optimize applications for maximum speed and scalability, with a focus\n\non simplicity and optimization to meet project requirements without\n\noverengineering solutions\n\n• Conduct code reviews and provide mentorship to junior developers\n\n• Work closely with UX designers to ensure the successful implementation\n\nof designs, providing guidance and support throughout the development\n\nprocess\n\n• Stay up-to-date with industry trends and best practices in React\n\ndevelopment, incorporating them into the full-scope development process\n\nwith other team members\n\n• Collaborate with backend developers to integrate user-facing elements\n\nwith serverside logic\n\n• Use modern development tools and frameworks to create high-quality\n\ncode and interactive prototypes\n\n• Ensure the technical feasibility of UI/UX designs\n\nRequirements:\n\n• 5+ years of experience as a React Developer, with the ability to\n\nprovide examples showcasing expertise in building complex web\n\napplications\n\n• Proficiency in JavaScript and React.js\n\n• Experience in optimizing applications for complex B2B environments,\n\nensuring streamlined solutions that avoid unnecessary complexity or\n\nredundant features\n\n• Strong understanding of responsive design principles and the ability\n\nto create interfaces that work seamlessly across different devices and\n\nscreen sizes\n\n• Familiarity with HTML5 and CSS3\n\n• Strong problem-solving skills and the ability to think critically\n\nabout user needs and technical challenges\n\n• Excellent communication and collaboration skills, with the ability to\n\nwork effectively in cross-functional teams\n\n• A passion for clean code, user-centered design, and a strong attention\n\nto detail\n\n• Relevant certifications in Python development or related fields are a\n\nplus.\n\nEducation:\n\n• Must have Bachelor’s Degree in a technology related discipline\n\nArena Technical Resources, LLC, (ATR) is an Equal Opportunity Employer\n\n(EOE) who will provide equal employment opportunity to employees and\n\napplicants for employment without regard to race, ethnicity, religion,\n\ncolor, sex, pregnancy, national origin, age, veteran status, ancestry,\n\nsexual orientation, gender identity or expression, marital status,\n\nfamily structure, genetic information, or mental or physical disability"
  },
  {
    "id": "XwYPHWrgvu0UkdblAAAAAA==",
    "title": "AEM UI developer- React JS",
    "company": "Capgemini",
    "location": "",
    "salary": "Not specified",
    "posted": "17d",
    "tags": "",
    "url": "https://www.indeed.com/viewjob?jk=5e3751446bd43f43&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "About the job you’re considering\n\nThe role requires React JS development experience with AEM UI exp.\n\nYour role\n• Develop and maintain responsive, high-performance web applications using ReactJS, adhering to the client React/JSX Style Guide.\n• integrating with AEM Content Fragments via GraphQL and REST APIs.\n• Instrument React applications with the Adobe Universal Editor for headless/headful content editing, ensuring seamless integration with AEM.\n• Build custom applications and extensions using Adobe AEM App Builder to manage content fragments and enhance user experiences.\n• Collaborate with backend teams to integrate with Node.js/Express servers and Apigee APIs\n• Optimize frontend performance and ensure cross-browser compatibility\n• Participate in code reviews, testing, and deployment within an Agile environment, utilizing monitoring tools like Application Insights and Splunk.\n\nYour skills and experience\n• Proficient in JavaScript (ES6+) and ReactJS.\n• Knowledge of Node.js and Express for backend integration.\n• Experience with Next.js (SSR/SSG) is a strong plus.\n• Hands-on experience with AEM Content Fragments, GraphQL, and REST APIs.\n• Proficiency with Adobe Universal Editor for content editing in React apps.\n• Familiarity with Adobe AEM App Builder for custom app development.\n• Experience with Azure cloud services (App Services) and Akamai CDN.\n• Understanding of API consumption (GraphQL, RESTful, OAuth).\n• Strong CSS/HTML skills for responsive and accessible design.\n• Ability to debug, optimize, and test frontend performance.\n• Experience with version control (e.g., Git) and CI/CD pipelines.\n• Preferable skills in server-side rendering (SSR) and static site generation (SSG) using frameworks like Next.js,\n• Excellent problem-solving, communication, and collaboration skills.\n• Ability to work effectively in a team and adapt to new tools.\n\n#LI-MS4 #LI-ONSITE\n\nLife at Capgemini\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n• Flexible work\n• Healthcare including dental, vision, mental health, and well-being programs\n• Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n• Paid time off and paid holidays\n• Paid parental leave\n• Family building benefits like adoption assistance, surrogacy, and cryopreservation\n• Social well-being benefits like subsidized back-up child/elder care and tutoring\n• Mentoring, coaching and learning programs\n• Employee Resource Groups\n• Disaster Relief\n\nAbout Capgemini\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to\nengineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\n\nGet the future you want | www.capgemini.com\n\nDisclaimer\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini discloses salary range information in compliance with state and local pay transparency obligations. The disclosed range represents the lowest to highest salary we, in good faith, believe we would pay for this role at the time of this posting, although we may ultimately pay more or less than the disclosed range, and the range may be modified in the future. The disclosed range takes into account the wide range of factors that are considered in making compensation decisions including, but not limited to, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, performance, sales or revenue-based metrics, and business or organizational needs. At Capgemini, it is not typical for an individual to be hired at or near the top of the range for their role. The base salary range for the tagged location is $76,200 - $178,290. This role may be eligible for other compensation including variable compensation, bonus, or commission. Full time regular employees are eligible for paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law."
  },
  {
    "id": "08myvbG6aVfESw9JAAAAAA==",
    "title": "Sr Full Stack Software Engineer - AWS CDK, REACT, TypeScript",
    "company": "CyberCoders",
    "location": "",
    "salary": "Not specified",
    "posted": "4d",
    "tags": "",
    "url": "https://www.linkedin.com/jobs/view/sr-full-stack-software-engineer-aws-cdk-react-typescript-at-cybercoders-4274101700?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "We're looking for highly talented, motivated/driven REMOTE Senior Full Stack Engineer to join the leading public sector media company that's based in Washington, DC. We're using cutting edge technologies and we want to continue to push you outside your comfort zone to continue to grow and broaden your skill set.\n\nIf you have the desire to build meaningful products, contribute to the design and development of complex SaaS products and enjoy working on a highly collaborative, cross-functional team, then please apply!\n\nWhat You Will Be Doing\n• Architect efficient and reusable front-end systems that drive complex web applications\n• Build platforms, systems and services for internal and external teams to interact with the large-scale production systems\n• Build tools and platforms to improve engineering productivity\n• Bring new ideas and technologies into our platform, innovate, and iterate\n• Design, develop, test, deploy, maintain, and improve software\n• Participate in daily standup\n• Create and review colleagues pull requests (PRs)\n\nWhat You Need For This Position\n• Has7+ years of experience as a Full Stack Software Engineer (React/TypeScript)\n• Has 7+ years of experience building AWS serverless applications - AWS CDK is a must have\n• Has experience with a few of the following - JavaScript, TypeScript, ES6+, Jest, Cypress\n• Has experience working with in a fast-paced environment with competing priorities\n• Strong with deploying AI applications, not just building them\n• Strong Docker and Kubernetes experience\n• Strong AWS cloud deployment experience\n• Has experience building responsive front-end applications\n• Has a strong sense of web design and attuned to the fundamentals of user experience\n• Has Experience building distributed systems\n• Enjoy working on a highly collaborative and cross-functional team\n• You are motivated to learn new skills and ship high quality, well-tested code\n\nOur Stack\n• AWS-serverless: CDK (must have), ECS, Dynamodb, Cloudfront, S3, RDS and Lambda\n• Python, Conda and Jupyter for Data Science\n• Monorepo on GitHub\n• React, React Native and TypeScript front-end\n• Jest and Cypress for testing\n• Sentry, CloudWatch and New Relic for monitoring\n• Docker, Kubernetes\n• Slack for communication\n• Latest Macbook for you\n\nBenefits\n• Competitive compensation package\n• Full health insurance benefits (medical, dental & vision)\n• 401k w/generous match\n• Generous PTO and all standard holidays\n• Employer paid life, short & long term disability\n• Position is 100% remote with occasional travel to office in Washington DC\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nnick.valenti@cybercoders.com\n• Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : NV1-1871437 -- in the email subject line for your application to be considered.***\n\nNick Valenti - Lead Recruiter\n\nFor this position, you must be currently authorized to work in the United States without the need for sponsorship for a non-immigrant visa.\n\nThis job was first posted by CyberCoders on 07/22/2025 and applications will be accepted on an ongoing basis until the position is filled or closed.\n\nCyberCoders is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable state and local law, including but not limited to the Los Angeles County Fair Chance Ordinance, the San Francisco Fair Chance Ordinance, and the California Fair Chance Act. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements."
  },
  {
    "id": "N95M2zMGpts1UP66AAAAAA==",
    "title": "React Developer (Always Recruiting)",
    "company": "Dev Talent Network",
    "location": "",
    "salary": "Not specified",
    "posted": "Recently",
    "tags": "",
    "url": "https://www.ziprecruiter.com/c/Dev-Talent-Network/Job/React-Developer-(Always-Recruiting)/-in-Washington,DC?jid=8df3738081ef006f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "Dev's Talent Network is designed to create a network of talented applicants who are interested in working for Dev Technology and are waiting for a job opening that matches their skills and experience. Here you will find positions we are \"always recruiting\" as well as an opportunity to share your resume with Dev, even if the job position you seek is not listed here today.\n\nThe Dev Talent Network is a community of highly qualified technical and management professionals recognized by Dev to demonstrate strong alignment with our company culture. The Dev Talent Network is comprised of candidates, referrals, Dev alumni, and fellow colleagues with whom we have worked in the past.\n\nWe're excited to evolve the Dev Talent Network so our members stay connected with Dev and discover new career opportunities with us.\n\nDev Technology Group is looking for a React Developer. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.\n\nWhat You'll Be Doing:\n• Develop the latest user-facing features using React.js\n• Use markup languages like HTML to create user-friendly web pages\n• Design a modern highly responsive web-based user interface\n• Build reusable components and front-end libraries for future use\n• Translate designs and wireframes into high-quality code\n• Optimize components for maximum performance across a vast array of web-capable devices and browsers\n• Coordinate with various teams working on distinct layers\n• Maintain and improve website\n• Optimize applications for maximum speed\n• Collaborate with back-end developers and web designers to improve usability\n• Get feedback from, and build solutions for, users and customers\n• Write functional requirement documents and guides\n• Create quality mockups and prototypes\n• Help back-end developers with coding and troubleshooting\n• Ensure high-quality graphic standards and brand consistency\n• Stay up-to-date on emerging technologies\n\nRequired Skills and Experience:\n• Bachelor's degree in Computer Science or related field\n• 5+ years Java/J2EE development\n• 5+ years experience with React, Node, Angular\n• Strong proficiency in JavaScript\n• Thorough understanding of React.js and its core principles\n• Proven work experience as a developer\n• Hands-on experience with markup languages\n• Experience with RESTful APIs\n• Experience with HTML/CSS\n• Experience with code versioning tools such as Git\n• Experience with modern front-end build pipelines and tools\n• Knowledge of Spring, Spring Boot, JPA, Hibernate frameworks\n• Knowledge of modern authorization mechanisms\n• An ability to perform well in a fast-paced environment\n• Excellent analytical skills\n\nPreferred Skills and Experience:\n• SQL preferred\n• PostgreSQL preferred\n• Angular UI or related UI frameworks preferred\n• Experience with Chef, Maven, Ansible preferred\n• Experience with AWS Lambda, AWS Dynamo DB, Other AWS tools (Elastic Search, Cloud Watch, Kinesis, etc) preferred\n• Typescript preferred\n• **By submitting your information you agree our talent recruitment team may use your contact information to reach out to you regarding new opportunities that may be applicable to your experience."
  },
  {
    "id": "Zr285p_Df-_hoplxAAAAAA==",
    "title": "Front End JavaScript React Developer",
    "company": "Amdex Corporation",
    "location": "",
    "salary": "Not specified",
    "posted": "Recently",
    "tags": "",
    "url": "https://www.tealhq.com/job/front-end-java-script-react-developer_e05d19eb-1a46-41b3-ac4f-5e05db626432?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "About the position\n\nThe Front End JavaScript React Developer will be responsible for developing, maintaining, and organizing a library of reusable JavaScript and React components for various applications and systems. This role requires translating wireframes into high-quality user interfaces, optimizing code for performance, and ensuring compliance with U.S. 508 standards. The position emphasizes collaboration with teams to enhance software development concepts and troubleshoot technical issues.\n\nResponsibilities\n• Develop, maintain and organize a library of reusable JS/React components for various applications and systems.\n,\n• Translate wireframes or high-fidelity mockups into high quality JS-enabled UI/UX.\n,\n• Optimize code components for maximum performance across an array of web-capable devices.\n,\n• Use modern JS Design Systems or UI Kits (Next, Material, Chakra, etc.).\n,\n• Develop all UI/UX components to be scalable using responsive design that behaves the same across all browsers.\n,\n• Develop RESTful APIs as well as modern authorization mechanisms such as JSON Web Tokens.\n,\n• Design components to meet U.S. 508 Compliance standards and modify existing Design System components to meet those standards.\n,\n• Communicate clearly and collaborate with teams to iterate on software development concepts and provide analysis of feasibility.\n,\n• Troubleshoot complex technical issues using tools to help debug and analyze data.\n\nRequirements\n• Bachelor's degree in related field and 3-5 years of front end web development experience\n,\n• 508 Compliance standards experience\n,\n• Experience with JavaScript, CSS, HTML, React.js, JSON Web Tokens, UI Kits/JS Design\n\nNice-to-haves\n\nBenefits\n• Medical | Dental | Vision (Base plan employee premiums 100% company paid)\n,\n• Supplemental Health Plans\n,\n• Employer Paid Life and Disability Insurance, STD and LTD\n,\n• Employee Assistance Plan and Employee Discounts\n,\n• 11 Federal Holidays | PTO accrual with carryover\n,\n• 401(k) Plan with company match | Flexible Spending Accounts: Medical, Dependent, Transit\n,\n• Tuition Reimbursement & Training Assistance"
  },
  {
    "id": "93_Jg9UutP34VHi1AAAAAA==",
    "title": "Senior Frontend Developer - React",
    "company": "beBeefrontend",
    "location": "",
    "salary": "Not specified",
    "posted": "1d",
    "tags": "",
    "url": "https://us.bebee.com/job/8aa338a02acaa74769905b4a643f97b9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "Job Overview\n\nWe are seeking a skilled professional to join our team as a Full Stack Developer with expertise in React. This role involves developing and deploying scalable web applications using cutting-edge technologies."
  },
  {
    "id": "DiA3bG97EI7qbz-jAAAAAA==",
    "title": "React & Node Developer - 10% 401k - FS Poly",
    "company": "stanleyreid",
    "location": "",
    "salary": "Not specified",
    "posted": "Recently",
    "tags": "",
    "url": "https://www.ziprecruiter.com/c/stanleyreid/Job/React-&-Node-Developer-10-401k-FS-Poly/-in-Mclean,VA?jid=71e1428d0e37d422&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_found": "2025-07-27",
    "source": "jsearch",
    "description": "Founded in 2010 by a technical leader, our client fosters a unique blend of collaborative spirit and professional excellence in IT consulting. Their laid-back, supportive environment encourages continuous learning with certification bonuses and flexible schedules. They demonstrate their commitment to employee well-being with industry-leading salaries, comprehensive benefits (10% 401k match, fully-paid medical, 6 weeks PTO), and a strong focus on work-life balance. With a portfolio of over 30 contracts across Maryland and Virginia, they offer the stability of large firms while retaining a close-knit, small-company feel. If you're a passionate tech professional seeking growth within a thriving team, this could be your perfect fit.\n\nThey are seeking a React / Node Developer to join their team.\n\nRelevant qualifications:\n-Experience with React.js and Node.js\n-Experience with JavaScript\n-Experience with HTML and CSS\n\nDesired:\n-Experience with cloud platforms\n-Experience with GraphQL\n-Experience with Docker\n-Experience with CI/CD pipelines\n\nThe work is located in Tysons, VA and requires a TS/SCI + FS Poly."
  }
]